2d_orifice_flow_sim/Archive/rev1/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 300; //14.855

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;  //14.855
    }

    outlet
    {
        type            zeroGradient;
    }

    wall1
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }

    // lowerWall
    // {
    //     type            epsilonWallFunction;
    //     value           uniform 14.855;
    // }

    // frontAndBack
    // {
    //     type            empty;
    // }
}


// ************************************************************************* //
