2d_orifice_flow_sim/Archive/rev1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform .375;

boundaryField
{
    inlet
    {
        type            fixedValue; 
        value           uniform .375;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall1
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
}
//     lowerWall
//     {
//         type            kqRWallFunction;
//         value           uniform 0.375;
//     }

//     frontAndBack
//     {
//         type            empty;
//     }
// }


// ************************************************************************* //
