2d_orifice_flow_sim/Archive/rev1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(rho|U|h|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.01;
    }

    "(rho|U|h|k|epsilon|e|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{

    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    pRefCell 0; 
    pRefValue 0;
    transonic   yes;
}


relaxationFactors
{
    equations
    {
        "(U|k|epsilon)"               0.95; // 0.9 is more stable but 0.95 more convergent
    }
}

// ************************************************************************* //
